n=input("Здравствуйте! Как вас зовут? ")
print(f"Очень приятно, {n}! Меня зовут Марк.")
a=int(input("Сколько Вам лет? "))
if a<78:
    print(f"Да, {n}, я старше вас на {78-a} лет.")
else:
    print(f"Да, {n}, Вы старше меня на {a-78} лет.")
    r=input("Вам нравится программировать? ")
    if r.lower()=="да":
        print("Превосходно! Уверен, у вас получится написать множество полезных и хороших программ.")
    else:
        print("Жаль. Я думал, Вы сможете написать интересную программу для меня.")
